//
//  Questions.swift
//  Notes
//
//  Created by Илья Бочков  on 3/12/20.
//  Copyright © 2020 Илья Бочков . All rights reserved.
//


/*
 
** Работа с сетью **
 1) Как сделать, чтобы webView.load() не использовал кэш (AuthorizationViewController), а запрашивал необходимые данные каждый раз
 2) Логика действий после авторизации:
    - загружать данные из гита и заменять существующие на них
    - загружать существующие данные на гит
    - загружать данные из гита, а затем добавлять к ним существующие данные
    Какую из них выбрать?
 3) Автоматическое обновление данных при поялвении интернета. Как реализовать?
    + возможные варианты логики (такие же, как в случае авторизации)
 4) Продолжение выгрузки данных на гит после сворачивания и завершения приложения

 ** UI **
 1) Некорректное отображение LeftMenu (размер выдвигаемой области зависит не от устройства, а от xib - файла
 2) Спиннер при загрузке данных:
    - alert
    - view поврех таблицы
    - в navigation controller
 
 ** Другие косяки **
 1) Не отображаются логи в консоли
 2) Снвоа сломался пуш из xcode
 
 */
